# Diploma
В папке диплом представлены код и данные, использованные для достижения поставленной цели. 

Директория "Код":

файл CAPM.py - расчет модели Шарма CAPM
файл ROA.py - расчет рентабельности активов предприятия
файл WACC.py - расчет средневзвешенных затрат на капитал
файл beta.py - расчет коэффициента beta для модели Шарма
файл EVA.py - расчет показателя экономической добавленной стоимости
файлы add_dates.py, data_for_WACC.py, listing.py, quotes.py - содержат код по сбору данных, необходимых для расчета показателей 

Директория "Данные":

В данной директории содержатся Excel-файлы в собранными для расчетов данные, а так же результаты дипломной работы
